Revit 2027 API
BuiltInFailures.GroupFailures.AdditionalElementsRequired Property
 Grouping the selected elements requires that additional element(s) also be grouped. [Description] To satisfy the grouping requirement, these additional element(s) will be automatically added to the group as well.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AdditionalElementsRequired { get; }
Public Shared ReadOnly Property AdditionalElementsRequired As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AdditionalElementsRequired {
	FailureDefinitionId^ get ();
}
static member AdditionalElementsRequired : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace